In [2]:
import pandas as pd
import numpy as np
a = np.random.randint(0,10,24).reshape(4,6)
df = pd.DataFrame(a, index=list("가나다라"), columns=list("ABCDEF"))
df

   A  B  C  D  E  F
가  6  1  6  0  4  4
나  1  3  7  0  5  8
다  9  2  2  8  1  5
라  1  6  9  1  3  0

In [4]:
df["A"]

가    6
나    1
다    9
라    1
Name: A, dtype: int32

In [5]:
df[['B', 'C', 'D']]

   B  C  D
가  1  6  0
나  3  7  0
다  2  2  8
라  6  9  1

In [6]:
df.loc['가', 'A']

6

In [8]:
df.loc['가':'다', 'A':'E']

   A  B  C  D  E
가  6  1  6  0  4
나  1  3  7  0  5
다  9  2  2  8  1

In [11]:
df.loc['가':'다', ['A','E', 'E']]

   A  E  E
가  6  4  4
나  1  5  5
다  9  1  1

In [12]:
df.loc['가':'다']

   A  B  C  D  E  F
가  6  1  6  0  4  4
나  1  3  7  0  5  8
다  9  2  2  8  1  5

In [13]:
df.iloc[0] # 가 행이 불러와짐

A    6
B    1
C    6
D    0
E    4
F    4
Name: 가, dtype: int32

In [19]:
df.iloc[0:3, [1,3,3]]

   B  D  D
가  1  0  0
나  3  0  0
다  2  8  8

In [23]:
df.drop("A", axis=1)  # columns를 drop 할때 axis=1, row를 drop 할때 axis=0(디폴트 값. 생략가능)

   B  C  D  E  F
가  1  6  0  4  4
나  3  7  0  5  8
다  2  2  8  1  5
라  6  9  1  3  0

In [24]:
# B, D, E, F열과 가나다 행의 자룔를 추출하라

df.loc['가':'다',['B','D','E','F']]

   B  D  E  F
가  1  0  4  4
나  3  0  5  8
다  2  8  1  5

In [26]:
df.iloc[:3, 1:].drop('C', axis=1)

   B  D  E  F
가  1  0  4  4
나  3  0  5  8
다  2  8  1  5